import numpy as np
import matplotlib.pyplot as plt
from matplotlib import cm

# 你提供的表格数据
data = {
    'DSC': [80.49, 81.58, 81.13, 80.55, 81.31, 81.10, 81.33, 80.64, 81.01, 80.61, 81.50, 79.81, 81.75, 80.55, 80, 81.92, 80.66, 80.35, 81.44, 80.51],
    'HD95': [21.18, 19.42, 16.05, 23.74, 19.57, 20.36, 24.6, 28.23, 25.07, 25.06, 21.31, 22.78, 18.87, 25.02, 27.54, 16.15, 26.03, 24.09, 23.55, 27.63],
    'Aorta': [86.53, 87.44, 87.61, 88.08, 86.88, 86.85, 85.92, 86.44, 86.51, 86.24, 86.24, 87.24, 86.90, 86.98, 86.74, 86.49, 87.15, 86.81, 86.88, 87.60],
    'Gallbladder': [65.35, 66.93, 65.40, 61.48, 63.58, 64.36, 70.82, 63.16, 64.83, 65.07, 64.46, 66.2, 67.2, 62.38, 68.35, 65.42, 63.07, 65.54, 61.64, 66.07],
    'Left Kidney': [85.49, 84.83, 85.81, 83.66, 85.16, 86.45, 85.24, 85.00, 84.88, 84.08, 86.34, 84.02, 87.59, 86.14, 83.55, 86.79, 86.04, 83.46, 86.84, 82.73],
    'Right Kidney': [77.67, 80.75, 78.65, 78.45, 82.11, 79.46, 76.68, 79.54, 78.38, 78.88, 80.55, 78.31, 81.55, 78.28, 73.14, 82.16, 77.38, 74.29, 80.94, 73.05],
    'Liver': [94.78, 94.64, 94.85, 94.78, 94.50, 94.46, 94.75, 94.50, 94.82, 94.63, 95.02, 94.40, 94.96, 94.83, 94.75, 94.80, 94.61, 94.66, 94.52, 94.64],
    'Pancreas': [62.2, 65.02, 66.17, 63.91, 65.92, 64.40, 64.11, 61.85, 66.25, 63.07, 64.35, 63.25, 65.72, 62.61, 63.69, 67.07, 65.14, 64.13, 67.43, 66.02],
    'Spleen': [90.86, 91.17, 89.62, 91.25, 91.19, 91.43, 90.40, 91.40, 90.35, 90.56, 91.23, 88.27, 89.41, 91.62, 89.92, 90.56, 90.46, 90.75, 92.02, 90.94],
    'Stomach': [81.06, 81.82, 80.96, 82.78, 81.15, 81.4, 82.7, 83.23, 82.1, 82.34, 83.77, 76.80, 80.69, 81.52, 79.77, 82.09, 81.42, 83.18, 81.28, 83.03]
}

# 计算均值和标准差
mean = {key: np.mean(value) for key, value in data.items()}
std = {key: np.std(value) for key, value in data.items()}
n = len(data['DSC'])  # 数据点数量

# 计算标准误差和95%的置信区间
se = {key: std[key] / np.sqrt(n) for key in data}
ci = {key: 1.96 * se[key] for key in data}


# 使用柔和的 Pastel1 调色板
colors = [
    '#6a0dad',  # 紫色
    '#8a2be2',  # 蓝紫色
    '#4682b4',  # 蓝色
    '#5f9ea0',  # 蓝绿色
    '#3cb371',  # 绿色
    '#2e8b57',  # 深绿色
    '#9acd32',  # 黄绿色
    '#ffd700',  # 金色
    '#ff8c00',  # 橙色
    '#ffa07a',  # 淡橙色
]

# 绘制带误差棒的图
labels = list(data.keys())
means = list(mean.values())
errors = list(ci.values())
plt.figure(figsize=(10, 6))
bars = plt.bar(labels, means, yerr=errors, capsize=9, color=colors, edgecolor='black')

# 设置y轴范围为0到100
plt.ylim(0, 100)

# 添加数据标签
for i, bar in enumerate(bars):
    plt.text(bar.get_x() + bar.get_width() / 2, bar.get_height() + errors[i] + 1,
             f'{means[i]:.2f} ± {errors[i]:.2f}', ha='center', va='bottom', fontsize=10)
# 在图形左上角添加误差棒代表的意义
plt.axhline(color='black', linestyle='-', label=f'Mean ± 95% CI')
plt.legend(loc='upper left')

plt.xticks(rotation=45, ha='right')
plt.tight_layout()
plt.savefig('./errorbar_synapse.png')